{
    "action": [
        {
            "name": "No Need for Tricks",
            "source": "BREW",
            "page": 1,
            "activity": {
                "number": 1,
                "unit": "action"
            },
            "frequency": {
                "unit": "round",
                "freq": 1
            },
            "actionType": {
                "archetype": ["Artificer|BREW"]
            },
            "traits": ["manipulate", "artificer"],
            "entries": [
                "You can activate the magic of an item of your level or lower that either casts a spell in your codex or is in your formula book. This counts as an automatic success on your attempt to Trick a Magic Item. You must know what activating the item does, or you can't attempt to trick it."
            ]
        }
    ],
    "spell": [
        {
            "name": "Wand Surge",
            "source": "BREW",
            "page": 1,
            "focus": true,
            "level": 4,
            "traits": ["uncommon", "transmutation"],
            "cast": {
                "number": 1,
                "unit": "action"
            },
            "components": [["S", "M"]],
            "requirements": "You are holding a wand.",
            "entries": [
                "You infuse the wand with extra power from an Eberron dragonshard. If your next action is to Cast a Spell from a wand, you overcharge the wand but reduce the DC of the flat check to DC 5.",
                "If the wand has already been overcharged today, you instead supercharge the wand. You cast the spell from the wand, then roll a DC 19 flat check.",
                {
                    "type": "successDegree",
                    "entries": {
                        "Success": "The wand is broken.",
                        "Failure": "The wand is destroyed.",
                        "Critical Failure": "The wand explodes with a powerful force. The wand deals 2d10 force damage in a 10-foot burst centered on you, with a basic Reflex Save. Your result cannot exceed Failure. For every level of the wand beyond 1, the damage increases by 2d10."
                    }
                }
            ]
        }
    ],
    "feat": [
        {
            "name": "Artificer Dedication",
            "source": "BREW",
            "page": 1,
            "level": 2,
            "traits": ["archetype", "dedication"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "trained in Crafting",
            "entries": [
                "Artificers devote their life to tinkering with the forces of magic, bending them to their will will nails and gears.",
                "You gain the Trick Magic Item skill feat. You also gain the No Need for Tricks activity.",
                "Additionally, you gain a codex, a special type of spellbook, that contains two 1st-level arcane spells. A codex can be used as a spellbook when preparing and casting spells, but does not give you the spellcasting feature. You can add arcane spells to your codex by Learn a Spell."
            ],
            "special": [
                "You can't select another dedication feat until you have gained two other feats from the Artificer archetype."
            ]
        },
        {
            "name": "Artificer Lore",
            "source": "BREW",
            "page": 1,
            "level": 2,
            "traits": ["archetype", "skill"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "entries": [
                "You gain the Magical Crafting skill feat, even if you don't meet the prerequisites. Additionally, you gain expert proficiency in Artifice Lore. At 6th, and 13th levels, you gain an additional skill increase to Artifice Lore. When rolling to Craft a magical item or Trick Magic Item, you can use Artifice Lore in place of the usual skill. For Tricking Magic Items, your proficiency with the tradition's skill is still used to determine the DC or spell attack.",
                "When you are crafting a magic item that requires you to supply a casting of an arcane spell whos level is no greater than half your level, you fulfil that requirement if the spell is in your codex."
            ]
        },
        {
            "name": "Scrapper",
            "source": "BREW",
            "page": 1,
            "level": 2,
            "traits": ["archetype", "skill"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "entries": [
                "You break down a magical item, extracting the arcane substance that powers it, Eberric dust. You spend 1 day tearing apart the item, which yields an amount of dust equal to the magic item's crafting cost. Each 100 gp of Eberric dust weights one L bulk.",
                "Eberric dust's properties are not well known by those untrained in the art of artifice and is unlikely to be found in the open market. When you craft a magic item, you can use Eberric dust as half of the raw material's gp value. For example, an item with a base cost of 200 gp in raw material can be crafted with 100 gp worth of Eberric dust while the remaining 100 gold of raw material is supplied by normal means."
            ]
        },
        {
            "name": "Coerce Staff",
            "source": "BREW",
            "page": 1,
            "level": 4,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "entries": [
                "During your daily preparations, you can prepare a magical staff and infuse it with an Eberron dragonshard. The staff gains 1 charge, or adds 1 charge to its usual amount. You can Cast a Spell from a staff by tricking it like a wand or scroll.",
                "At 7th level and ever two levels after that, the staff gains 1 additional charge, up to a maximum of 5 charges at 15th level."
            ]
        },
        {
            "name": "Prolific Inventor",
            "source": "BREW",
            "page": 1,
            "level": 4,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; expert in Crafting",
            "entries": [
                "You gain the Inventor skill feat, even if you don't meet that feat's prerequisites.",
                "When you take this feat, add the formulas for two common magic items up to 4th level to your formula book. Whenever you take an artificer archetype feat, you gain an additional formula of up to the level that you took the feat at."
            ]
        },
        {
            "name": "Spell Slinger",
            "source": "BREW",
            "page": 1,
            "level": 4,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "activity": {
                "number": 1,
                "unit": "action"
            },
            "entries": [
                "You interact to retrieve a wand, scroll, or magic item that requires activation and then use Trick Magic Item or No Need for Tricks on it."
            ]
        },
        {
            "name": "Spellwright",
            "source": "BREW",
            "page": 1,
            "level": 4,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; Magical Crafting",
            "entries": [
                "You have a small supply of special Eberron dragonshards that are capable changing their properties. Each day during your daily preparations, you can create a single temporary wand containing a 1st-level spell. The spell must be one in your codex. This wand is an unstable, temporary item and loses its magic the next time you make your daily preparations. It can't be used to Learn the Spell.",
                "At 6th level, you can create a second wand which contains a 2nd level spell. At 8th level, you can create a third wand which contains a 3rd level spell.",
                "Additionally, when you use wands and scrolls that you have tricked, you are considered trained for spell attack rolls and spell DCs, using your Intelligence modifier, with the spells it casts."
            ]
        },
        {
            "name": "Esoteric Insights",
            "source": "BREW",
            "page": 1,
            "level": 6,
            "traits": ["archetype", "skill"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "entries": [
                "Your study of esoteric practices and the effect of Eberron dragonshards on its magic allows you to emulate them through artifice. You can add occult spells to your codex as you would arcane spells. In addition when you craft occult magic items, you ignore any requirements related to class, alignment, or belief system. When you would roll Occultism to identify magic item's or Trick a Magic Item, you can choose to roll Arcana instead."
            ]
        },
        {
            "name": "Halcyon Insights",
            "source": "BREW",
            "page": 1,
            "level": 6,
            "traits": ["archetype", "skill"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "entries": [
                "Your study of primal practices and the effect of Eberron dragonshards on its magic allows you to emulate them through artifice. You can add primal spells to your codex as you would arcane spells. In addition when you craft primal magic items, you ignore any requirements related to class, alignment, or belief system. When you would roll Nature to identify magic item's or Trick a Magic Item, you can choose to roll Arcana instead."
            ]
        },
        {
            "name": "Theological Insights",
            "source": "BREW",
            "page": 1,
            "level": 6,
            "traits": ["archetype", "skill"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication",
            "entries": [
                "Your study of divine practices and the effect of Eberron dragonshards on its magic allows you to emulate them through artifice. You can add divine spells to your codex as you would arcane spells. In addition when you craft divine magic items, you ignore any requirements related to class, alignment, or belief system. When you would roll Religion to identify magic item's or Trick a Magic Item, you can choose to roll Arcana instead."
            ]
        },
        {
            "name": "Intuitive Understanding",
            "source": "BREW",
            "page": 1,
            "level": 8,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; master in Crafting",
            "entries": [
                "Your study of the different magic traditions has created an intuitive understanding of simple magic items.",
                "All 1st and 2nd level magic items that require you to trick them with a skill you are an expert in are always tricked in your hands."
            ]
        },
        {
            "name": "Wring Wand",
            "source": "BREW",
            "page": 1,
            "level": 8,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; master in Crafting",
            "entries": [
                "You have learned how to force every last drop of power out of your wands.",
                "You gain the Wand Surge focus spell. Increase the number of Focus Points in your focus pool by 1. You can Refocus by tinkering or repairing with magic items."
            ]
        },
        {
            "name": "Expert Spellwright",
            "source": "BREW",
            "page": 1,
            "level": 12,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; master in Arcana",
            "entries": [
                "When you create wands for Spellwright, you can create a fourth wand with a 4th level spell.",
                "At 14th level, you can create a fifth wand which contains a 5th level spell. At 16th level, you can create a sixth wand which contains a 6th level spell.",
                "Additionally, when you use wands and scrolls that you have tricked, you are considered an expert for spell attack rolls and spell DCs, using your Intelligence modifier, with the spells it casts."
            ]
        },
        {
            "name": "Intuitive Master",
            "source": "BREW",
            "page": 1,
            "level": 16,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; Intuitive Understanding; legendary in Crafting",
            "entries": [
                "Your unparalleled experience with the different magic traditions ingrained a complex understanding.",
                "Any magic item of half your level or lower that could be tricked by you using a skill you are a master in is always tricked in your hands."
            ]
        },
        {
            "name": "Master Spellwright",
            "source": "BREW",
            "page": 1,
            "level": 18,
            "traits": ["archetype"],
            "featType": {
                "archetype": ["Artificer"]
            },
            "prerequisites": "Artificer Dedication; Expert Spellwright; legendary in Arcana",
            "entries": [
                "When you create wands for Spellwright, you can create a seventh wand with a 7th level spell.",
                "At 20th level, you can create a eighth wand which contains a 8th level spell.",
                "Additionally, when you use wands and scrolls that you have tricked, you are considered a master for spell attack rolls and spell DCs, using your Intelligence modifier, with the spells it casts."
            ]
        }
    ]
}
