[
    {
        "id": "feat.archetype.cyran-avenger.class.brew.always-ready",
        "color": "",
        "title": "Always Ready",
        "icon_front": "rank-2",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | Extensive training against aberrant has taught you to cover your weak points, even when you think that you're alone. You aren't flat-footed to hidden, undetected, or flanking aberrant of your level or lower. However, the aberrant can still help their allies flank. If all of your opponents are aberrant, you gain a +1 circumstance bonus to initiative rolls; the GM determines whether to apply this bonus if aberrant are disguised as another type of creature, if another type of creature is disguised as aberrant, or if there are additional opponents you haven't noticed who aren't aberrant."
        ],
        "level": 4
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.bless-shield",
        "color": "",
        "title": "Bless Shield [[one-action]]",
        "icon_front": "rank-2",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype | divine",
            "property | Prerequisites | Cyran Avenger Dedication, you worship a good-aligned deity",
            "rule",
            "text | Your uttered prayers become an aegis, drawing the blessing of your deity across the surface of your shield. Until the beginning of your next turn your shield, any shield boss, or shield spikes gain the effects of a ghost touch property rune. Additionally, damage you take as a result of an incorporeal creature's Strike can trigger your Shield Block reaction, even if the damage isn't physical damage."
        ],
        "level": 4
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.flashing-shield",
        "color": "",
        "title": "Flashing Shield [[free-action]]",
        "icon_front": "rank-2",
        "code": "feat 8",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication, you worship a good-aligned deity",
            "property | Trigger | You use the Shield Block reaction, and the opponent that triggered the Shield Block is aberrant and adjacent to you.",
            "rule",
            "text | Your shield flares with holy light as you block the attack, searing the aberrant with the power of your faith. The triggering aberrant takes positive damage equal to half your level and becomes flat-footed for 1 round."
        ],
        "level": 8
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.grave-sight",
        "color": "",
        "title": "Grave Sight",
        "icon_front": "rank-2",
        "code": "feat 10",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication, Grave Sense",
            "rule",
            "text | Your ability to sense aberrant has improved. You sense aberrant as an imprecise sense (Core Rulebook 464) with a range of 60 feet: an uncomfortable sensation brushes against your spirit and stinks of rot. When in proximity to an aberrant, you can sense its presence, but it has the hidden condition instead of the observed condition. An aberrant using a disguise or otherwise trying to hide its presence must attempt a Deception or Stealth check against your Perception DC to hide its presence from you. If the creature succeeds, it's undetected, and you have to use the Seek basic action to detect the creature. As with hearing and other imprecise senses, you still need to Seek to locate an undetected creature."
        ],
        "level": 10
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.warped-bulwark",
        "color": "",
        "title": "Warped Bulwark",
        "icon_front": "rank-2",
        "code": "feat 8",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | Regular exposure to transmutation effects left you better able to defend against them. When you have your shield raised, you gain your shield's circumstance bonus to saving throws against effects that would deal negative damage. If you have the Shield Block reaction, negative damage you take can trigger the reaction, even though the damage isn't physical damage."
        ],
        "level": 8
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.no-stranger-to-death",
        "color": "",
        "title": "No Stranger to Death",
        "icon_front": "rank-2",
        "code": "feat 12",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | Your regular exposure to the insidious putrescence of undeath inured you to its effects. You gain a +2 circumstance bonus to saving throws made against spells and effects with the death, disease, and evil traits. Whenever you become drained or sickened, reduce the status penalty you take from the condition by 1, to a minimum of 0."
        ],
        "level": 12
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.nonlethal-takedown",
        "color": "",
        "title": "Nonlethal Takedown",
        "icon_front": "rank-2",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | You prefer to use nonlethal means against living opponents, but the weapons you carry are lethal enough to destroy aberrant. You don't take the normal –2 circumstance penalty when attacking nonlethally with a weapon that lacks the nonlethal trait."
        ],
        "level": 4
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.practiced-opposition",
        "color": "",
        "title": "Practiced Opposition [[one-action]]",
        "icon_front": "rank-2",
        "code": "feat 6",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | You've battled more aberrant than you care to remember, often with little time to prepare between foes, forcing you to rely on experience and muscle memory to guide your blade. Attempt a check to Recall Knowledge about an aberrant you can see and then Strike that aberrant. If your attempt to Recall Knowledge is successful, your Strike treats the target's resistances as 5 lower. The target is then immune to your Practiced Opposition for 24 hours."
        ],
        "level": 6
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.repulse-the-wicked",
        "color": "",
        "title": "Repulse the Wicked [[reaction]]",
        "icon_front": "rank-2",
        "code": "feat 6",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "property | Trigger | An aberrant within your reach critically fails an attack roll targeting you.",
            "rule",
            "text | You use your foe's failure as an opening to push them away. You attempt to Shove the aberrant."
        ],
        "level": 6
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.resolute-defender",
        "color": "",
        "title": "Resolute Defender",
        "icon_front": "rank-2",
        "code": "feat 14",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | You hold your shield together with the power of your faith and conviction, refusing to let wood splinter and steel shatter until the day's battles are won. If a shield would be destroyed due to damage taken during your Shield Block, the shield remains intact at 1 Hit Point instead. Its construction is weakened until you repair it, preventing you from using Resolute Defender to save the same shield again until your next daily preparations."
        ],
        "level": 14
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.sacred-armaments",
        "color": "",
        "title": "Sacred Armaments",
        "icon_front": "rank-2",
        "code": "feat 6",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | Through the power of your conviction, your weapons are fully effective against incorporeal creatures.",
            "text | Weapons you wield have the effects of a ghost touch property rune for as long as you wield them."
        ],
        "level": 6
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.thwart-evil",
        "color": "",
        "title": "Thwart Evil [[reaction]]",
        "icon_front": "rank-2",
        "code": "feat 14",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication, master in Religion",
            "property | Trigger | A creature you can see uses a spell or ability that has the evil or negative traits.",
            "property | Frequency | once per day",
            "rule",
            "text | You react instinctively when you sense evil forming, thrusting your spiritual energy toward the source to snuff out evil before it fully manifests. Attempt to counteract the triggering spell or ability using your Religion modifier as your counteract modifier."
        ],
        "level": 14
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.withstand-death",
        "color": "",
        "title": "Withstand Death",
        "icon_front": "rank-2",
        "code": "feat 16",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication, Warped Resistance",
            "rule",
            "text | Through repeated exposure, you've trained to resist the damage wrought by aberrant. Your resistance to negative damage also applies to damage dealt by the attacks and abilities of aberrant creatures, regardless of damage type."
        ],
        "level": 16
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.rescuers-press",
        "color": "",
        "title": "Rescuer's Press",
        "icon_front": "rank-2",
        "code": "feat 4",
        "contents": [
            "pftrait | rare | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | Any shield you wield gains the shove trait. When you Shove using a shield and Stride as part of that action, you can move an additional 5 feet to either side of the creature you Shoved. In addition, if you are in the Everstand Stance and successfully Shove a creature using a shield that you wield two-handed, you can increase the distance of your Shove to 10 feet."
        ],
        "level": 4
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.eye-of-metrol",
        "color": "",
        "title": "Eye Of Metrol",
        "icon_front": "rank-2",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication, expert in Perception",
            "rule",
            "text | You've learned how to spot danger at a distance, allowing you to serve as a sentry with ease. You gain a +2 circumstance bonus to initiative rolls when using Perception, and when you're Scouting, you grant your allies a +2 circumstance bonus instead of +1."
        ],
        "level": 4
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.grave-sense",
        "color": "",
        "title": "Grave Sense",
        "icon_front": "rank-2",
        "code": "feat 6",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | Your time spent hunting the aberrant allows you to sense them.",
            "text | You sense aberrant as a vague sense (Core Rulebook 465) similar to a human's sense of smell, an uncomfortable sensation akin to smelling something cloying and rotting. When in proximity to the aberrant, you eventually sense their presence, though you might not do so instantly, and you can't pinpoint their location. An aberrant using a disguise or otherwise trying to hide its presence must attempt a Deception check against your Perception DC to hide its presence from you. If the creature succeeds at its Deception check, it is then temporarily immune to your Grave Sense for 1 day."
        ],
        "level": 6
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.new-cyre-warden",
        "color": "",
        "title": "New Cyre Warden",
        "icon_front": "rank-2",
        "code": "feat 10",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | You use your shield to protect your allies, not just yourself, especially against the aberrant. When you have a shield raised, you can use your Shield Block reaction when an attack is made against an ally adjacent to you, in addition to its usual trigger. If you do, the shield prevents that ally from taking damage instead of you, following the normal rules for a Shield Block.",
            "text | If an aberrant makes an attack against an ally within 10 feet, you can Step to become adjacent to your ally and then use Shield Block as part of the same reaction."
        ],
        "level": 10
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.warped-resistance",
        "color": "",
        "title": "Warped Resistance",
        "icon_front": "rank-2",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | As part of your training, you've inured yourself against transmutation through repeated exposure. You gain a +1 circumstance bonus to saves against transmutation effects and gain resistance to negative damage equal to half your level."
        ],
        "level": 4,
        "extra": ["section | Leads to", "bullet | Warped Tenacity"]
    },
    {
        "id": "feat.archetype.cyran-avenger.class.brew.warped-tenacity",
        "color": "",
        "title": "Warped Tenacity",
        "icon_front": "rank-2",
        "code": "feat 8",
        "contents": [
            "pftrait | archetype",
            "property | Prerequisites | Warped Resistance",
            "rule",
            "text | Your training against transmutation effects allows you to escape the worst of their touch. If you roll a success on a saving throw against a transmutation effect, you get a critical success instead; if you roll a critical failure on such a save, you get a failure instead."
        ],
        "level": 8
    },
    {
        "id": "feat.archetype.cyran-avenger.dedication.brew.cyran-avenger-dedication",
        "color": "",
        "title": "Cyran Avenger Dedication",
        "icon_front": "rank-3",
        "code": "feat 2",
        "contents": [
            "pftrait | uncommon | archetype | dedication",
            "property | Prerequisites | Cyran citizen, Shield Block",
            "rule",
            "text | You've sworn yourself as a sentry for New Cyre, the first line of defense against incursions by the Mournland. You become trained in Athletics and in Mournland Lore; if you were already trained, you become an expert instead. Finally, you gain the Reactive Shield fighter feat."
        ],
        "level": 2,
        "reference": ["Reactive Shield"]
    },
    {
        "id": "feat.archetype.cyran-avenger.skill.brew.familiar-foe",
        "color": "",
        "title": "Familiar Foe",
        "icon_front": "moebius-star",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype | skill",
            "property | Prerequisites | Cyran Avenger Dedication, expert in Religion or Mournland Lore",
            "rule",
            "text | You regularly face off against aberrant and can identify many with a glance. You gain a +1 circumstance bonus on skill checks to Recall Knowledge about aberrant. Whenever you roll a critical failure on a check to Recall Knowledge about aberrant, you get a failure instead."
        ],
        "level": 4
    },
    {
        "id": "feat.archetype.cyran-avenger.skill.brew.final-rest",
        "color": "",
        "title": "Final Rest",
        "icon_front": "moebius-star",
        "code": "feat 4",
        "contents": [
            "pftrait | archetype | skill",
            "property | Prerequisites | Cyran Avenger Dedication",
            "rule",
            "text | As stubborn in death as you are in life, you vow you'll never aid your hated enemies. You can't be transformed into an aberrant, except by effects that originate from an artifact or deity. Aberrant creatures that touch your corpse take 1 force damage each time they do, or 1d6 force damage each time they expose themselves to your corpse in a more thorough manner, such as by biting or carrying your corpse."
        ],
        "level": 4
    }
]
